app/controllers/admin/location_types_controller.rb

INSERT INTO "location_types" ("name", "updated_at", "created_at") VALUES('house', '2010-07-09 02:25:58', '2010-07-09 02:25:58')
---
  def create
    @location_type = LocationType.new(params[:location_type])

    respond_to do |format|
      if @location_type.save