app/controllers/admin/users_controller.rb

INSERT INTO "users" ("salt", "name", "activated_at", "updated_at", "crypted_password", "cell", "remember_token_expires_at", "activation_code", "remember_token", "reset_code", "login", "email", "created_at", "depot_id") VALUES('890660f7332ede0232e3883d7ee723860e3a3e19', 'Andy', NULL, '2010-07-09 02:20:46', '10fc180993e9df406a63d6b5be7bd9d9d47e0699', '+403 401 1954', NULL, '50b023888a059b8ad659149a3c2206200940a3ed', NULL, NULL, 'andyd', 'andy@igiveada.mn', '2010-07-09 02:20:46', NULL)
---
  def create
    @user = User.new(params[:user])
    @user.save!