app/controllers/depots_controller.rb

SELECT * FROM "regions" WHERE ("regions"."id" = 1)
---
  def index
    @local_depots = Depot.find(:all).collect! { |depot| Integer(depot.region.id) == Integer(session[:region]) ? depot : nil }.compact

SELECT * FROM "depots" WHERE ("depots"."id" = 1)
---
  def show
    @depot = Depot.find(params[:id])

SELECT * FROM "depots" WHERE ("depots"."id" = 1)
---
  def edit
    @depot = Depot.find(params[:id])

INSERT INTO "depots" ("name", "volunteer_contact", "updated_at", "driving_directions", "main_contact", "goods_cell", "goods_contact", "volunteer_cell", "description", "region_id", "goods_summary", "main_cell", "address", "created_at") VALUES('the warehouse', '', '2010-07-09 02:26:40', '', '', '', '', '', 'kasd', 1, '', '', 'adfas', '2010-07-09 02:26:40')
---
  def create
    @depot = Depot.new(params[:depot])

    respond_to do |format|
      if @depot.save