app/controllers/locations_controller.rb

  def occupancies_for
    @locations = Location.find(:all, :conditions => ["active = 1"])
---
SELECT * FROM "locations" WHERE (active = 1)

  def index
    @locations = Location.find(:all, :conditions => ["active = 1"], :order => sort_order('name'))
---
SELECT * FROM "locations" WHERE (active = 1) ORDER BY name ASC

  def activate
    @location = Location.find(params[:id])
    @location.active = !@location.active
    @location.save
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)
UPDATE "locations" SET "active" = 't', "updated_by" = 1, "updated_at" = '2010-07-09 02:28:26' WHERE "id" = 1

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)